THEME_CHOICES = [
        ('背景音乐', '背景音乐'),
        ('经典老歌', '经典老歌'),
        ('KTV金曲', 'KTV金曲'),
        ('游戏配乐', '游戏配乐'),
        ('电影配乐', '电影配乐'),
]

SCENE_CHOICES = [
    ('咖啡馆', '咖啡馆'),
    ('运动', '运动'),
    ('睡前', '睡前'),
    ('旅行', '旅行'),
    ('派对', '派对'),
]

MOOD_CHOICES = [
    ('伤感', '伤感'),
    ('安静', '安静'),
    ('思念', '思念'),
    ('宣泄', '宣泄'),
]

STYLE_CHOICES = [
    ('摇滚', '摇滚'),
    ('民谣', '民谣'),
    ('轻音乐', '轻音乐'),
    ('电音', '电音'),
    ('流行', '流行'),
]

LANGUAGE_CHOICES = [
    ('英语', '英语'),
    ('日语', '日语'),
    ('粤语', '粤语'),
    ('国语', '国语'),
    ('韩语', '韩语'),
]