THEME_CHOICES = [
    ('背景音乐', '背景音乐'),
    ('经典老歌', '经典老歌'),
    ('KTV金曲', 'KTV金曲'),
    ('游戏配乐', '游戏配乐'),
    ('电影配乐', '电影配乐'),
    ('情歌', '情歌'),
    ('乐器', '乐器'),
    ('ACG', 'ACG'),
    ('厂牌专区', '厂牌专区'),
    ('综艺', '综艺'),

]

SCENE_CHOICES = [
    ('咖啡馆', '咖啡馆'),
    ('运动', '运动'),
    ('睡前', '睡前'),
    ('旅行', '旅行'),
    ('派对', '派对'),
    ('夜店', '夜店'),
    ('学习工作', '学习工作'),
    ('跳舞', '跳舞'),
    ('婚礼', '婚礼'),
    ('约会', '约会'),
    ('校园', '校园'),
    ('驾驶', '驾驶'),
]

MOOD_CHOICES = [
    ('伤感', '伤感'),
    ('安静', '安静'),
    ('思念', '思念'),
    ('宣泄', '宣泄'),
    ('开心', '开心'),
    ('励志', '励志'),
    ('治愈', '治愈'),
    ('甜蜜', '甜蜜'),
    ('寂寞', '寂寞'),
]

STYLE_CHOICES = [
    ('摇滚', '摇滚'),
    ('民谣', '民谣'),
    ('轻音乐', '轻音乐'),
    ('电音', '电音'),
    ('流行', '流行'),
    ('金属', '金属'),
    ('说唱', '说唱'),
    ('中国风', '中国风'),
    ('布鲁斯', '布鲁斯'),
    ('乡村', '乡村'),
    ('古典', '古典'),
    ('爵士', '爵士'),
    ('中国传统', '中国传统'),

]

LANGUAGE_CHOICES = [
    ('英语', '英语'),
    ('日语', '日语'),
    ('粤语', '粤语'),
    ('国语', '国语'),
    ('韩语', '韩语'),
    ('法语', '法语'),
    ('拉丁语', '拉丁语'),
    ('闽南语', '闽南语'),
    ('小语种', '小语种'),
]

# 消息通知类型
NOTICE_TYPE_CHOICES = [
    ('系统通知', '系统通知'),
    ('评论通知', '评论通知'),
    ('喜欢通知', '喜欢通知'),
    ('关注通知', '关注通知'),
    ('私信通知', '私信通知'),
]
